# Проект FitLife - MVP версия 1.0

#Шаг 1. Знакомство с пользователем (создаём дружелюбный интерфейс)
print("Привет!,Давайте познакомимся!:)")
#Запрос имени и сохранение в переменную
user_name = input("Как тебя зовут?:")
#Запрос возраста и преобразование в число
user_age = input("Сколько тебе лет?:")
user_age_int=int(user_age)
# Вывод данных
print(f"Приятно познакомиться,{user_name}!")
#Шаг 2. Сбор параметров и расчёты (добавляем полезную логику)
print("Теперь давай рассчитаем ИМТ и норму воды!:)")
#Запрос Веса и преобразование в Float
user_weight = float(input("Введите ваш вес в килограммах:"))
#Запрос роста и преобразование в Float
user_height = float(input("Введите ваш рост в метрах(например,2.1):"))
#Рассчет ИМТ вес(кг)/(рост(м)**2)
bmi = user_weight / (user_height ** 2) 
#Округляем ИМТ
bmi_rounded = round(bmi, 1)
#Расчет нормы воды в мл.
water_ml = user_weight * 30
#Перевод в литры
water_l = water_ml / 1000
#Округляем литры
water_l_rounded = round(water_l, 2)
#Вывод 
print(f"Отчет для пользователя: {user_name}, {user_age_int}лет")
print(f"Твой Индекс Массы Тела: {bmi_rounded}")
print(f"Рекомендуемая норма воды: {water_l_rounded} л")
print("Расчет окончен. Будьте здоровы! ")